{
    "nodes": [
        {
            "name": "softmax/label",
            "partition": [
                "R",
                "R"
            ],
            "op": "null",
            "cost": 0,
            "inputs": []
        },
        {
            "name": "data",
            "partition": [
                "r",
                "r"
            ],
            "op": "null",
            "cost": 0,
            "inputs": []
        },
        {
            "name": "convolution0/weight",
            "partition": [
                "R",
                "C"
            ],
            "op": "null",
            "cost": 0,
            "inputs": []
        },
        {
            "name": "convolution0",
            "partition": [
                "R",
                "R"
            ],
            "op": "Convolution",
            "cost": 77440,
            "inputs": [
                "data",
                "convolution0/weight"
            ]
        },
        {
            "name": "activation0",
            "partition": [
                "R",
                "R"
            ],
            "op": "Activation",
            "cost": 0,
            "inputs": [
                "convolution0"
            ]
        },
        {
            "name": "pooling0",
            "partition": [
                "R",
                "R"
            ],
            "op": "Pooling",
            "cost": 0,
            "inputs": [
                "activation0"
            ]
        },
        {
            "name": "convolution1/weight",
            "partition": [
                "R",
                "R"
            ],
            "op": "null",
            "cost": 0,
            "inputs": []
        },
        {
            "name": "convolution1",
            "partition": [
                "R",
                "R"
            ],
            "op": "Convolution",
            "cost": 921600,
            "inputs": [
                "pooling0",
                "convolution1/weight"
            ]
        },
        {
            "name": "activation1",
            "partition": [
                "R",
                "R"
            ],
            "op": "Activation",
            "cost": 0,
            "inputs": [
                "convolution1"
            ]
        },
        {
            "name": "pooling1",
            "partition": [
                "R",
                "R"
            ],
            "op": "Pooling",
            "cost": 0,
            "inputs": [
                "activation1"
            ]
        },
        {
            "name": "convolution2/weight",
            "partition": [
                "R",
                "R"
            ],
            "op": "null",
            "cost": 0,
            "inputs": []
        },
        {
            "name": "convolution2",
            "partition": [
                "R",
                "R"
            ],
            "op": "Convolution",
            "cost": 1990656,
            "inputs": [
                "pooling1",
                "convolution2/weight"
            ]
        },
        {
            "name": "activation2",
            "partition": [
                "R",
                "R"
            ],
            "op": "Activation",
            "cost": 0,
            "inputs": [
                "convolution2"
            ]
        },
        {
            "name": "convolution3/weight",
            "partition": [
                "R",
                "R"
            ],
            "op": "null",
            "cost": 0,
            "inputs": []
        },
        {
            "name": "convolution3",
            "partition": [
                "R",
                "R"
            ],
            "op": "Convolution",
            "cost": 2654208,
            "inputs": [
                "activation2",
                "convolution3/weight"
            ]
        },
        {
            "name": "activation3",
            "partition": [
                "R",
                "R"
            ],
            "op": "Activation",
            "cost": 0,
            "inputs": [
                "convolution3"
            ]
        },
        {
            "name": "convolution4/weight",
            "partition": [
                "R",
                "R"
            ],
            "op": "null",
            "cost": 0,
            "inputs": []
        },
        {
            "name": "convolution4",
            "partition": [
                "R",
                "R"
            ],
            "op": "Convolution",
            "cost": 1769472,
            "inputs": [
                "activation3",
                "convolution4/weight"
            ]
        },
        {
            "name": "activation4",
            "partition": [
                "R",
                "R"
            ],
            "op": "Activation",
            "cost": 0,
            "inputs": [
                "convolution4"
            ]
        },
        {
            "name": "pooling2",
            "partition": [
                "R",
                "R"
            ],
            "op": "Pooling",
            "cost": 0,
            "inputs": [
                "activation4"
            ]
        },
        {
            "name": "flatten0",
            "partition": [
                "R",
                "R"
            ],
            "op": "Flatten",
            "cost": 0,
            "inputs": [
                "pooling2"
            ]
        },
        {
            "name": "fullyconnected0/weight",
            "partition": [
                "R",
                "R"
            ],
            "op": "null",
            "cost": 0,
            "inputs": []
        },
        {
            "name": "fullyconnected0",
            "partition": [
                "R",
                "R"
            ],
            "op": "FullyConnected",
            "cost": 3932160,
            "inputs": [
                "flatten0",
                "fullyconnected0/weight"
            ]
        },
        {
            "name": "activation5",
            "partition": [
                "R",
                "R"
            ],
            "op": "Activation",
            "cost": 0,
            "inputs": [
                "fullyconnected0"
            ]
        },
        {
            "name": "fullyconnected1/weight",
            "partition": [
                "R",
                "R"
            ],
            "op": "null",
            "cost": 0,
            "inputs": []
        },
        {
            "name": "fullyconnected1",
            "partition": [
                "R",
                "R"
            ],
            "op": "FullyConnected",
            "cost": 1966080,
            "inputs": [
                "activation5",
                "fullyconnected1/weight"
            ]
        },
        {
            "name": "activation6",
            "partition": [
                "R",
                "R"
            ],
            "op": "Activation",
            "cost": 0,
            "inputs": [
                "fullyconnected1"
            ]
        },
        {
            "name": "fullyconnected2/weight",
            "partition": [
                "R",
                "R"
            ],
            "op": "null",
            "cost": 0,
            "inputs": []
        },
        {
            "name": "fullyconnected2",
            "partition": [
                "R",
                "R"
            ],
            "op": "FullyConnected",
            "cost": 1671168,
            "inputs": [
                "activation6",
                "fullyconnected2/weight"
            ]
        },
        {
            "name": "softmax",
            "partition": [
                "R",
                "R"
            ],
            "op": "SoftmaxOutput",
            "cost": 0,
            "inputs": [
                "fullyconnected2",
                "softmax/label"
            ]
        },
        {
            "name": "softmax/backward",
            "partition": [
                "r",
                "r"
            ],
            "op": "_backward_SoftmaxOutput",
            "cost": 393216,
            "inputs": [
                "softmax/label",
                "softmax"
            ]
        },
        {
            "name": "fullyconnected2/backward",
            "partition": [
                "r",
                "r"
            ],
            "op": "_backward_FullyConnected",
            "cost": 7864320,
            "inputs": [
                "softmax/backward",
                "activation6",
                "fullyconnected2/weight"
            ]
        },
        {
            "name": "activation6/backward",
            "partition": [
                "r",
                "r"
            ],
            "op": "_backward_Activation",
            "cost": 1572864,
            "inputs": [
                "fullyconnected2/backward",
                "activation6"
            ]
        },
        {
            "name": "fullyconnected1/backward",
            "partition": [
                "R",
                "R"
            ],
            "op": "_backward_FullyConnected",
            "cost": 3145728,
            "inputs": [
                "activation6/backward",
                "activation5",
                "fullyconnected1/weight"
            ]
        },
        {
            "name": "activation5/backward",
            "partition": [
                "R",
                "R"
            ],
            "op": "_backward_Activation",
            "cost": 0,
            "inputs": [
                "fullyconnected1/backward",
                "activation5"
            ]
        },
        {
            "name": "fullyconnected0/backward",
            "partition": [
                "R",
                "R"
            ],
            "op": "_backward_FullyConnected",
            "cost": 7471104,
            "inputs": [
                "activation5/backward",
                "flatten0",
                "fullyconnected0/weight"
            ]
        },
        {
            "name": "flatten0_backward",
            "partition": [
                "R",
                "R"
            ],
            "op": "_backward_copy",
            "cost": 0,
            "inputs": [
                "fullyconnected0/backward"
            ]
        },
        {
            "name": "pooling2/backward",
            "partition": [
                "R",
                "R"
            ],
            "op": "_backward_Pooling",
            "cost": 0,
            "inputs": [
                "flatten0_backward",
                "activation4",
                "pooling2"
            ]
        },
        {
            "name": "activation4/backward",
            "partition": [
                "R",
                "R"
            ],
            "op": "_backward_Activation",
            "cost": 0,
            "inputs": [
                "pooling2/backward",
                "activation4"
            ]
        },
        {
            "name": "convolution4/backward",
            "partition": [
                "r",
                "r"
            ],
            "op": "_backward_Convolution",
            "cost": 20152320,
            "inputs": [
                "activation4/backward",
                "activation3",
                "convolution4/weight"
            ]
        },
        {
            "name": "activation3/backward",
            "partition": [
                "R",
                "R"
            ],
            "op": "_backward_Activation",
            "cost": 0,
            "inputs": [
                "convolution4/backward",
                "activation3"
            ]
        },
        {
            "name": "convolution3/backward",
            "partition": [
                "R",
                "R"
            ],
            "op": "_backward_Convolution",
            "cost": 5308416,
            "inputs": [
                "activation3/backward",
                "activation2",
                "convolution3/weight"
            ]
        },
        {
            "name": "activation2/backward",
            "partition": [
                "R",
                "R"
            ],
            "op": "_backward_Activation",
            "cost": 0,
            "inputs": [
                "convolution3/backward",
                "activation2"
            ]
        },
        {
            "name": "convolution2/backward",
            "partition": [
                "R",
                "R"
            ],
            "op": "_backward_Convolution",
            "cost": 3981312,
            "inputs": [
                "activation2/backward",
                "pooling1",
                "convolution2/weight"
            ]
        },
        {
            "name": "pooling1/backward",
            "partition": [
                "R",
                "R"
            ],
            "op": "_backward_Pooling",
            "cost": 0,
            "inputs": [
                "convolution2/backward",
                "activation1",
                "pooling1"
            ]
        },
        {
            "name": "activation1/backward",
            "partition": [
                "R",
                "R"
            ],
            "op": "_backward_Activation",
            "cost": 0,
            "inputs": [
                "pooling1/backward",
                "activation1"
            ]
        },
        {
            "name": "convolution1/backward",
            "partition": [
                "r",
                "r"
            ],
            "op": "_backward_Convolution",
            "cost": 19759104,
            "inputs": [
                "activation1/backward",
                "pooling0",
                "convolution1/weight"
            ]
        },
        {
            "name": "pooling0/backward",
            "partition": [
                "R",
                "C"
            ],
            "op": "_backward_Pooling",
            "cost": 12390400,
            "inputs": [
                "convolution1/backward",
                "activation0",
                "pooling0"
            ]
        },
        {
            "name": "activation0/backward",
            "partition": [
                "R",
                "R"
            ],
            "op": "_backward_Activation",
            "cost": 12390400,
            "inputs": [
                "pooling0/backward",
                "activation0"
            ]
        },
        {
            "name": "convolution0/backward",
            "partition": [
                "R",
                "R"
            ],
            "op": "_backward_Convolution",
            "cost": 123904,
            "inputs": [
                "activation0/backward",
                "data",
                "convolution0/weight"
            ]
        }
    ]
}